Repository: shuto-S/codex-app-mobile
Catalog: CodexAppMobile/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

source: %@ limit
ja: %@ 制限
zh_hans: %@ 限制
zh_hant: %@ 限制

source: %@ used / %@
ja: %@ 使用 / %@
zh_hans: 已用 %@ / %@
zh_hant: 已用 %@ / %@

source: %@%% left
ja: 残り %@%%
zh_hans: 剩余 %@%%
zh_hant: 剩餘 %@%%

source: %@%% left (%@ used / %@)
ja: 残り %@%%（使用 %@ / %@）
zh_hans: 剩余 %@%%（已用 %@ / %@）
zh_hant: 剩餘 %@%%（已用 %@ / %@）

source: %lld question(s) waiting for answer
ja: 回答待ちの質問が %lld 件あります
zh_hans: 有 %lld 个问题等待回答
zh_hant: 有 %lld 個問題等待回答

source: (empty command)
ja: （空のコマンド）
zh_hans: （空命令）
zh_hant: （空命令）

source: (resets %@)
ja: （%@ にリセット）
zh_hans: （%@ 重置）
zh_hant: （%@ 重設）

source: /absolute/path or ~
ja: /absolute/path または ~
zh_hans: /absolute/path 或 ~
zh_hant: /absolute/path 或 ~

source: 5h limit
ja: 5時間制限
zh_hans: 5小时限制
zh_hant: 5 小時限制

source: 7d limit
ja: 7日制限
zh_hans: 7天限制
zh_hant: 7 天限制

source: Accept
ja: 承認
zh_hans: 接受
zh_hant: 接受

source: Accept + Save Exec Policy
ja: 承認して実行ポリシーを保存
zh_hans: 接受并保存执行策略
zh_hant: 接受並儲存執行策略

source: Accept + Save Exec Policy (Unavailable)
ja: 承認して実行ポリシーを保存（利用不可）
zh_hans: 接受并保存执行策略（不可用）
zh_hant: 接受並儲存執行策略（不可用）

source: Accept for Session
ja: 本会话中接受
zh_hans: 本会话接受
zh_hant: 本工作階段接受

source: Add
ja: 追加
zh_hans: 添加
zh_hant: 新增

source: Add Project
ja: プロジェクトを追加
zh_hans: 添加项目
zh_hant: 新增專案

source: Add a host from Hosts first.
ja: 先に Hosts でホストを追加してください。
zh_hans: 请先在 Hosts 中添加主机。
zh_hant: 請先在 Hosts 中新增主機。

source: All known hosts were removed.
ja: 既知ホストをすべて削除しました。
zh_hans: 已删除所有已知主机。
zh_hant: 已刪除所有已知主機。

source: Allow host %@
ja: ホスト %@ を許可
zh_hans: 允许主机 %@
zh_hant: 允許主機 %@

source: Answer
ja: 回答
zh_hans: 回答
zh_hant: 回答

source: Apply Network Policy (Unavailable)
ja: ネットワークポリシーを適用（利用不可）
zh_hans: 应用网络策略（不可用）
zh_hant: 套用網路策略（不可用）

source: Apply Network Policy: %@ %@
ja: ネットワークポリシーを適用: %@ %@
zh_hans: 应用网络策略：%@ %@
zh_hant: 套用網路策略：%@ %@

source: Approval Policy
ja: 承認ポリシー
zh_hans: 审批策略
zh_hant: 核准策略

source: Archive
ja: アーカイブ
zh_hans: 归档
zh_hant: 封存

source: Auth status: %@
ja: 認証状態: %@
zh_hans: 认证状态：%@
zh_hant: 驗證狀態：%@

source: Authentication
ja: 認証
zh_hans: 认证
zh_hant: 驗證

source: Authentication failed. Check username/password in host settings.
ja: 認証に失敗しました。ホスト設定のユーザー名/パスワードを確認してください。
zh_hans: 认证失败。请检查主机设置中的用户名/密码。
zh_hant: 驗證失敗。請檢查主機設定中的使用者名稱/密碼。

source: Auto
ja: 自動
zh_hans: 自动
zh_hant: 自動

source: Back
ja: 戻る
zh_hans: 返回
zh_hant: 返回

source: Back to hosts
ja: ホストに戻る
zh_hans: 返回主机列表
zh_hant: 返回主機列表

source: Base branch
ja: ベースブランチ
zh_hans: 基准分支
zh_hant: 基準分支

source: Basic
ja: 基本
zh_hans: 基本
zh_hant: 基本

source: CLI version: %@
ja: CLI バージョン: %@
zh_hans: CLI 版本：%@
zh_hant: CLI 版本：%@

source: Cancel
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

source: Cancel Turn
ja: ターンをキャンセル
zh_hans: 取消本轮
zh_hant: 取消本輪

source: Canceled.
ja: キャンセルしました。
zh_hans: 已取消。
zh_hant: 已取消。

source: Close
ja: 閉じる
zh_hans: 关闭
zh_hant: 關閉

source: Code Review
ja: コードレビュー
zh_hans: 代码审查
zh_hant: 程式碼審查

source: Code review
ja: コードレビュー
zh_hans: 代码审查
zh_hant: 程式碼審查

source: Code review (%@)
ja: コードレビュー（%@）
zh_hans: 代码审查（%@）
zh_hant: 程式碼審查（%@）

source: Codex CLI version %@ is not supported. Required: %@+
ja: Codex CLI バージョン %@ はサポートされていません。必要: %@+
zh_hans: 不支持 Codex CLI 版本 %@。要求：%@+
zh_hant: 不支援 Codex CLI 版本 %@。需求：%@+

source: Codex requests file-change approval.
ja: Codex がファイル変更の承認を要求しています。
zh_hans: Codex 请求文件变更审批。
zh_hant: Codex 要求檔案變更核准。

source: Command
ja: コマンド
zh_hans: 命令
zh_hant: 命令

source: Command Approval
ja: コマンド承認
zh_hans: 命令审批
zh_hant: 命令審批

source: Commands
ja: コマンド
zh_hans: 命令
zh_hant: 命令

source: Compatibility
ja: 互換性
zh_hans: 兼容性
zh_hant: 相容性

source: Connected to app-server.
ja: app-server に接続しました。
zh_hans: 已连接到 app-server。
zh_hant: 已連線至 app-server。

source: Connection
ja: 接続
zh_hans: 连接
zh_hant: 連線

source: Connection Error
ja: 接続エラー
zh_hans: 连接错误
zh_hant: 連線錯誤

source: Context
ja: 上下文
zh_hans: 上下文
zh_hant: 上下文

source: Could not load
ja: 読み込みできませんでした
zh_hans: 无法加载
zh_hant: 無法載入

source: Could not parse remote directory output.
ja: 远端目录输出を解析できませんでした。
zh_hans: 无法解析远程目录输出。
zh_hant: 無法解析遠端目錄輸出。

source: Create Project
ja: プロジェクトを作成
zh_hans: 创建项目
zh_hant: 建立專案

source: Create or update a skill
ja: スキルを作成または更新
zh_hans: 创建或更新技能
zh_hant: 建立或更新技能

source: Current
ja: 現在
zh_hans: 当前
zh_hant: 目前

source: Current model: %@
ja: 現在のモデル: %@
zh_hans: 当前模型：%@
zh_hant: 目前模型：%@

source: Decision
ja: 決定
zh_hans: 决策
zh_hant: 決策

source: Decline
ja: 拒否
zh_hans: 拒绝
zh_hant: 拒絕

source: Defaults
ja: デフォルト
zh_hans: 默认值
zh_hant: 預設值

source: Delete
ja: 削除
zh_hans: 删除
zh_hant: 刪除

source: Delete "%@"? This cannot be undone.
ja: "%@" を削除しますか？この操作は元に戻せません。
zh_hans: 要删除“%@”吗？此操作无法撤销。
zh_hant: 要刪除「%@」嗎？此操作無法復原。

source: Delete All
ja: すべて削除
zh_hans: 全部删除
zh_hant: 全部刪除

source: Delete Project
ja: プロジェクトを削除
zh_hans: 删除项目
zh_hant: 刪除專案

source: Delete all stored host keys?
ja: 保存済みホスト鍵をすべて削除しますか？
zh_hans: 要删除所有已保存的主机密钥吗？
zh_hant: 要刪除所有已儲存的主機金鑰嗎？

source: Delete this host?
ja: このホストを削除しますか？
zh_hans: 要删除此主机吗？
zh_hant: 要刪除此主機嗎？

source: Delete this project?
ja: このプロジェクトを削除しますか？
zh_hans: 要删除此项目吗？
zh_hant: 要刪除此專案嗎？

source: Deny host %@
ja: ホスト %@ を拒否
zh_hans: 拒绝主机 %@
zh_hant: 拒絕主機 %@

source: Diagnostics
ja: 診断
zh_hans: 诊断
zh_hant: 診斷

source: Diff against the branch you specify.
ja: 指定したブランチとの差分を確認します。
zh_hans: 与你指定的分支进行对比。
zh_hant: 與你指定的分支進行比較。

source: Directories
ja: ディレクトリ
zh_hans: 目录
zh_hant: 目錄

source: Directory listing timed out.
ja: ディレクトリ一覧がタイムアウトしました。
zh_hans: 目录列表请求超时。
zh_hant: 目錄清單要求逾時。

source: Disable Plan Mode
ja: 计划模式をオフ
zh_hans: 关闭计划模式
zh_hant: 關閉計畫模式

source: Disconnect
ja: 切断
zh_hans: 断开连接
zh_hant: 中斷連線

source: Edit
ja: 編集
zh_hans: 编辑
zh_hant: 編輯

source: Edit Host
ja: ホストを編集
zh_hans: 编辑主机
zh_hant: 編輯主機

source: Edit Project
ja: プロジェクトを編集
zh_hans: 编辑项目
zh_hant: 編輯專案

source: Enter a base branch name.
ja: ベースブランチ名を入力してください。
zh_hans: 请输入基准分支名称。
zh_hant: 請輸入基準分支名稱。

source: Ephemeral threads cannot be archived
ja: 一時スレッドはアーカイブできません
zh_hans: 临时线程无法归档
zh_hant: 暫時執行緒無法封存

source: Ephemeral threads cannot be archived.
ja: 一時スレッドはアーカイブできません。
zh_hans: 临时线程无法归档。
zh_hant: 暫時執行緒無法封存。

source: Ephemeral threads cannot be forked.
ja: 一時スレッドはフォークできません。
zh_hans: 临时线程无法分叉。
zh_hant: 暫時執行緒無法分支。

source: Error
ja: エラー
zh_hans: 错误
zh_hant: 錯誤

source: Exec Policy Proposal
ja: 执行策略提案
zh_hans: 执行策略提议
zh_hant: 執行策略提議

source: Executed via codex exec over SSH.
ja: SSH 経由で codex exec を実行しました。
zh_hans: 已通过 SSH 执行 codex exec。
zh_hant: 已透過 SSH 執行 codex exec。

source: Failed to load remote directories.
ja: リモートディレクトリの読み込みに失敗しました。
zh_hans: 加载远程目录失败。
zh_hant: 載入遠端目錄失敗。

source: Failed to resolve thread.
ja: スレッドを解決できませんでした。
zh_hans: 无法解析线程。
zh_hant: 無法解析執行緒。

source: Failed to send command: %@
ja: コマンド送信に失敗しました: %@
zh_hans: 发送命令失败：%@
zh_hant: 傳送命令失敗：%@

source: File Change
ja: ファイル変更
zh_hans: 文件变更
zh_hant: 檔案變更

source: File Change Approval
ja: ファイル変更承認
zh_hans: 文件变更审批
zh_hant: 檔案變更審批

source: File system: read %@ path(s), write %@ path(s)
ja: ファイルシステム: 読み取り %@ パス、書き込み %@ パス
zh_hans: 文件系统：读取 %@ 个路径，写入 %@ 个路径
zh_hant: 檔案系統：讀取 %@ 個路徑，寫入 %@ 個路徑

source: Fork
ja: フォーク
zh_hans: 分叉
zh_hant: 分支

source: Fork the current thread.
ja: 現在のスレッドをフォークします。
zh_hans: 分叉当前线程。
zh_hant: 分支目前執行緒。

source: Forked from %@
ja: %@ からフォーク
zh_hans: 从 %@ 分叉
zh_hant: 從 %@ 分支

source: Forked thread: %@
ja: フォークしたスレッド: %@
zh_hans: 已分叉线程：%@
zh_hant: 已分支執行緒：%@

source: Generating reply
ja: 応答を生成中
zh_hans: 正在生成回复
zh_hant: 正在產生回覆

source: Health
ja: ヘルス
zh_hans: 健康状态
zh_hant: 健康狀態

source: Hide Keyboard
ja: キーボードを隠す
zh_hans: 隐藏键盘
zh_hant: 隱藏鍵盤

source: High
ja: 高
zh_hans: 高
zh_hant: 高

source: Home
ja: ホーム
zh_hans: 主目录
zh_hant: 主目錄

source: Host
ja: ホスト
zh_hans: 主机
zh_hant: 主機

source: Host (default: Basic Host)
ja: ホスト（デフォルト: 基本ホスト）
zh_hans: 主机（默认：基本主机）
zh_hant: 主機（預設：基本主機）

source: Host Not Found
ja: ホストが見つかりません
zh_hans: 未找到主机
zh_hant: 找不到主機

source: Host key changed. Reconnect from Terminal and trust the new key.
ja: ホスト鍵が変更されました。Terminal から再接続して新しい鍵を信頼してください。
zh_hans: 主机密钥已变更。请从 Terminal 重新连接并信任新密钥。
zh_hant: 主機金鑰已變更。請從 Terminal 重新連線並信任新金鑰。

source: Host keys are saved after the first successful connection.
ja: ホスト鍵は初回接続成功後に保存されます。
zh_hans: 主机密钥会在首次连接成功后保存。
zh_hant: 主機金鑰會在首次連線成功後儲存。

source: Host not found.
ja: ホストが見つかりません。
zh_hans: 未找到主机。
zh_hant: 找不到主機。

source: Host: %@ (%@)
ja: ホスト: %@ (%@)
zh_hans: 主机：%@ (%@)
zh_hant: 主機：%@ (%@)

source: Hosts
ja: ホスト
zh_hans: 主机
zh_hant: 主機

source: Install curated skills from openai/skills or other repositories
ja: openai/skills などのリポジトリから厳選スキルをインストール
zh_hans: 从 openai/skills 或其他仓库安装精选技能
zh_hant: 從 openai/skills 或其他儲存庫安裝精選技能

source: Invalid app-server URL. Use ws:// or wss://.
ja: 無効な app-server URL です。ws:// または wss:// を使用してください。
zh_hans: 无效的 app-server URL。请使用 ws:// 或 wss://。
zh_hant: 無效的 app-server URL。請使用 ws:// 或 wss://。

source: Invalid app-server host (%@). Use a reachable host or Tailscale IP, not 0.0.0.0/localhost.
ja: 無効な app-server ホスト（%@）です。0.0.0.0/localhost ではなく、到達可能なホストまたは Tailscale IP を使用してください。
zh_hans: 无效的 app-server 主机（%@）。请使用可达主机或 Tailscale IP，不要用 0.0.0.0/localhost。
zh_hant: 無效的 app-server 主機（%@）。請使用可達主機或 Tailscale IP，不要用 0.0.0.0/localhost。

source: Known Hosts
ja: 既知ホスト
zh_hans: 已知主机
zh_hant: 已知主機

source: Last RPC error: %@%@
ja: 最後の RPC エラー: %@%@
zh_hans: 最近 RPC 错误：%@%@
zh_hant: 最近 RPC 錯誤：%@%@

source: Last RPC error: none
ja: 最後の RPC エラー: なし
zh_hans: 最近 RPC 错误：无
zh_hant: 最近 RPC 錯誤：無

source: Last ping
ja: 最后一次 ping
zh_hans: 最近 ping
zh_hant: 最近 ping

source: Last successful ping: %@
ja: 最後の成功 ping: %@
zh_hans: 最近成功 ping：%@
zh_hant: 最近成功 ping：%@

source: Last successful ping: unknown
ja: 最後の成功 ping: 不明
zh_hans: 最近成功 ping：未知
zh_hant: 最近成功 ping：未知

source: Loading...
ja: 読み込み中...
zh_hans: 加载中...
zh_hant: 載入中...

source: Low
ja: 低
zh_hans: 低
zh_hant: 低

source: MCP Status
ja: MCP 状態
zh_hans: MCP 状态
zh_hant: MCP 狀態

source: MCP servers:
ja: MCP サーバー:
zh_hans: MCP 服务器：
zh_hant: MCP 伺服器：

source: MCP servers: none reported.
ja: MCP サーバー: 報告なし。
zh_hans: MCP 服务器：无上报。
zh_hant: MCP 伺服器：無回報。

source: MCP status
ja: MCP 状态
zh_hans: MCP 状态
zh_hant: MCP 狀態

source: MCP status is unavailable on this server.
ja: このサーバーでは MCP ステータスを利用できません。
zh_hans: 此服务器上不可用 MCP 状态。
zh_hant: 此伺服器上無法使用 MCP 狀態。

source: Malformed response from app-server.
ja: app-server から不正なレスポンスを受信しました。
zh_hans: app-server 返回了格式错误的响应。
zh_hant: app-server 回傳了格式錯誤的回應。

source: Medium
ja: 中
zh_hans: 中
zh_hant: 中

source: Method
ja: メソッド
zh_hans: 方法
zh_hant: 方法

source: Minimal
ja: 最小
zh_hans: 最低
zh_hant: 最低

source: Model
ja: モデル
zh_hans: 模型
zh_hant: 模型

source: Model (optional)
ja: モデル（任意）
zh_hans: 模型（可选）
zh_hant: 模型（選填）

source: Name
ja: 名称
zh_hans: 名称
zh_hant: 名稱

source: Name (optional)
ja: 名称（任意）
zh_hans: 名称（可选）
zh_hant: 名稱（選填）

source: Navigate
ja: ナビゲート
zh_hans: 导航
zh_hant: 導覽

source: Network Policy
ja: ネットワークポリシー
zh_hans: 网络策略
zh_hant: 網路策略

source: Network: %@
ja: ネットワーク: %@
zh_hans: 网络：%@
zh_hant: 網路：%@

source: New Host
ja: 新規ホスト
zh_hans: 新建主机
zh_hant: 新建主機

source: New Project
ja: 新規プロジェクト
zh_hans: 新建项目
zh_hant: 新建專案

source: New Thread
ja: 新規スレッド
zh_hans: 新建线程
zh_hant: 新建執行緒

source: No Hosts
ja: ホストがありません
zh_hans: 没有主机
zh_hant: 沒有主機

source: No Known Hosts
ja: 既知ホストはありません
zh_hans: 没有已知主机
zh_hant: 沒有已知主機

source: No MCP status available
ja: MCP 状態はありません
zh_hans: 暂无 MCP 状态
zh_hant: 暫無 MCP 狀態

source: No commands or skills available
ja: 利用可能なコマンドまたはスキルがありません
zh_hans: 没有可用的命令或技能
zh_hant: 沒有可用的命令或技能

source: No messages yet.
ja: まだメッセージはありません。
zh_hans: 还没有消息。
zh_hant: 還沒有訊息。

source: No projects yet.
ja: まだプロジェクトがありません。
zh_hans: 还没有项目。
zh_hant: 還沒有專案。

source: No projects.
ja: プロジェクトがありません。
zh_hans: 没有项目。
zh_hant: 沒有專案。

source: No rate-limit data available
ja: レート制限データがありません
zh_hans: 暂无速率限制数据
zh_hant: 暫無速率限制資料

source: No status available
ja: 状態情報がありません
zh_hans: 暂无状态信息
zh_hant: 暫無狀態資訊

source: No subdirectories
ja: サブディレクトリがありません
zh_hans: 没有子目录
zh_hant: 沒有子目錄

source: No terminal output yet.
ja: まだターミナル出力がありません。
zh_hans: 尚无终端输出。
zh_hant: 尚無終端輸出。

source: No thread to archive
ja: アーカイブするスレッドがありません
zh_hans: 没有可归档的线程
zh_hant: 沒有可封存的執行緒

source: No threads
ja: スレッドがありません
zh_hans: 没有线程
zh_hant: 沒有執行緒

source: Not connected to app-server.
ja: app-server に接続されていません。
zh_hans: 未连接到 app-server。
zh_hant: 未連線到 app-server。

source: Open
ja: 開く
zh_hans: 打开
zh_hant: 開啟

source: Open commands and select /review again.
ja: コマンドを開いて /review を再選択してください。
zh_hans: 请打开命令面板并重新选择 /review。
zh_hant: 請開啟命令面板並重新選擇 /review。

source: Password (optional)
ja: パスワード（任意）
zh_hans: 密码（可选）
zh_hant: 密碼（選填）

source: Permission
ja: 権限
zh_hans: 权限
zh_hant: 權限

source: Ping latency: %@ ms
ja: Ping レイテンシ: %@ ms
zh_hans: Ping 延迟：%@ ms
zh_hant: Ping 延遲：%@ ms

source: Ping latency: unknown
ja: Ping レイテンシ: 不明
zh_hans: Ping 延迟：未知
zh_hant: Ping 延遲：未知

source: Plan
ja: 计划
zh_hans: 计划
zh_hant: 計畫

source: Plan mode
ja: 计划模式
zh_hans: 计划模式
zh_hant: 計畫模式

source: Plan mode disabled.
ja: 計画モードを無効化しました。
zh_hans: 计划模式已关闭。
zh_hant: 計畫模式已關閉。

source: Plan mode enabled. Send a prompt to continue.
ja: 計画モードを有効化しました。続けるにはプロンプトを送信してください。
zh_hans: 已启用计划模式。发送提示词以继续。
zh_hant: 已啟用計畫模式。請傳送提示詞以繼續。

source: Plan mode enabled. Server capability is unknown; we will try on send.
ja: 計画モードを有効化しました。サーバー対応は不明ですが、送信時に試行します。
zh_hans: 已启用计划模式。服务器能力未知，发送时将尝试使用。
zh_hant: 已啟用計畫模式。伺服器能力未知，傳送時將嘗試使用。

source: Plan mode enabled. This server may not support it; we will retry without it if rejected.
ja: 計画モードを有効化しました。このサーバーは未対応の可能性があります。拒否された場合は無効で再試行します。
zh_hans: 已启用计划模式。此服务器可能不支持；若被拒绝将自动重试默认模式。
zh_hant: 已啟用計畫模式。此伺服器可能不支援；若被拒絕將自動以預設模式重試。

source: Plan mode was not applied by the server. Prompt sent in default mode.
ja: サーバーで計画モードが適用されませんでした。デフォルトモードで送信しました。
zh_hans: 服务器未应用计划模式。已按默认模式发送提示词。
zh_hant: 伺服器未套用計畫模式。已以預設模式傳送提示詞。

source: Plan mode will apply to the next new turn after the active turn completes.
ja: アクティブなターン完了後の次の新規ターンに計画モードが適用されます。
zh_hans: 计划模式将在当前活动轮次完成后的下一次新轮次生效。
zh_hant: 計畫模式將在目前進行中的輪次完成後的下一個新輪次生效。

source: Plan type: %@
ja: プラン種別: %@
zh_hans: 套餐类型：%@
zh_hant: 方案類型：%@

source: Port
ja: ポート
zh_hans: 端口
zh_hant: 連接埠

source: Project
ja: プロジェクト
zh_hans: 项目
zh_hant: 專案

source: Project deleted.
ja: プロジェクトを削除しました。
zh_hans: 项目已删除。
zh_hant: 專案已刪除。

source: Protocol
ja: プロトコル
zh_hans: 协议
zh_hant: 協議

source: RPC error: %@%@
ja: RPC エラー: %@%@
zh_hans: RPC 错误：%@%@
zh_hant: RPC 錯誤：%@%@

source: Ready for a new thread. Send a prompt to start.
ja: 新しいスレッドの準備ができました。開始するにはプロンプトを送信してください。
zh_hans: 已准备好新线程。发送提示词即可开始。
zh_hant: 已準備好新執行緒。請傳送提示詞開始。

source: Reasoning
ja: 推論強度
zh_hans: 推理强度
zh_hant: 推理強度

source: Reconnect attempts: %@
ja: 再接続試行: %@
zh_hans: 重连尝试：%@
zh_hant: 重新連線嘗試：%@

source: Reconnects
ja: 再接続回数
zh_hans: 重连次数
zh_hant: 重連次數

source: Refresh
ja: 更新
zh_hans: 刷新
zh_hant: 重新整理

source: Refreshing MCP server status...
ja: MCP サーバー状態を更新中...
zh_hans: 正在刷新 MCP 服务器状态...
zh_hant: 正在重新整理 MCP 伺服器狀態...

source: Refreshing status...
ja: 状態を更新中...
zh_hans: 正在刷新状态...
zh_hant: 正在重新整理狀態...

source: Reload
ja: 再読み込み
zh_hans: 重新加载
zh_hant: 重新載入

source: Reloaded local thread state.
ja: 本地スレッド状態を再読み込みしました。
zh_hans: 已重新加载本地线程状态。
zh_hant: 已重新載入本地執行緒狀態。

source: Remote Paths
ja: リモートパス
zh_hans: 远程路径
zh_hant: 遠端路徑

source: Remote error [%@]: %@
ja: リモートエラー [%@]: %@
zh_hans: 远端错误 [%@]：%@
zh_hant: 遠端錯誤 [%@]：%@

source: Remove composer token %@
ja: コンポーザートークン %@ を削除
zh_hans: 移除输入 token %@
zh_hant: 移除輸入 token %@

source: Request timed out: %@
ja: リクエストがタイムアウトしました: %@
zh_hans: 请求超时：%@
zh_hant: 請求逾時：%@

source: Requested Access
ja: 要求されたアクセス
zh_hans: 请求的权限
zh_hant: 要求的權限

source: Required >= %@
ja: 必要バージョン >= %@
zh_hans: 要求 >= %@
zh_hant: 需求 >= %@

source: Review against a base branch
ja: ベースブランチとの比較レビュー
zh_hans: 与基准分支进行评审
zh_hant: 與基準分支進行審查

source: Review uncommitted changes
ja: 未コミット変更をレビュー
zh_hans: 评审未提交的更改
zh_hant: 審查未提交的變更

source: Root
ja: ルート
zh_hans: 根目录
zh_hant: 根目錄

source: Run
ja: 実行
zh_hans: 运行
zh_hant: 執行

source: Run reviewer on current changes.
ja: 現在の変更に対してレビューを実行します。
zh_hans: 对当前更改运行评审。
zh_hant: 對目前變更執行審查。

source: SSH Port
ja: SSH ポート
zh_hans: SSH 端口
zh_hant: SSH 連接埠

source: SSH password is empty. If authentication fails, set the password in host settings and retry.
ja: SSH パスワードが空です。認証に失敗した場合はホスト設定でパスワードを設定して再試行してください。
zh_hans: SSH 密码为空。如认证失败，请在主机设置中设置密码后重试。
zh_hant: SSH 密碼為空。若驗證失敗，請在主機設定中設定密碼後重試。

source: SSH ready (%@).
ja: SSH 準備完了（%@）。
zh_hans: SSH 已就绪（%@）。
zh_hant: SSH 已就緒（%@）。

source: Save
ja: 保存
zh_hans: 保存
zh_hant: 儲存

source: Select a project first.
ja: 先にプロジェクトを選択してください。
zh_hans: 请先选择项目。
zh_hant: 請先選擇專案。

source: Select a project.
ja: プロジェクトを選択してください。
zh_hans: 请选择项目。
zh_hant: 請選擇專案。

source: Select a thread first.
ja: 先にスレッドを選択してください。
zh_hans: 请先选择线程。
zh_hant: 請先選擇執行緒。

source: Select project
ja: プロジェクトを選択
zh_hans: 选择项目
zh_hant: 選擇專案

source: Send prompt
ja: 送信
zh_hans: 发送提示词
zh_hant: 傳送提示詞

source: Server Request
ja: サーバーリクエスト
zh_hans: 服务器请求
zh_hant: 伺服器請求

source: Session
ja: セッション
zh_hans: 会话
zh_hant: 工作階段

source: Session state: %@
ja: セッション状態: %@
zh_hans: 会话状态：%@
zh_hant: 工作階段狀態：%@

source: Show Keyboard
ja: キーボードを表示
zh_hans: 显示键盘
zh_hant: 顯示鍵盤

source: Show MCP server availability.
ja: MCP サーバーの可用性を表示します。
zh_hans: 显示 MCP 服务器可用性。
zh_hant: 顯示 MCP 伺服器可用性。

source: Show connection, model, and catalog status.
ja: 接続、モデル、カタログ状態を表示します。
zh_hans: 显示连接、模型和目录状态。
zh_hant: 顯示連線、模型與目錄狀態。

source: Skill
ja: スキル
zh_hans: 技能
zh_hant: 技能

source: Skill %@
ja: スキル %@
zh_hans: 技能 %@
zh_hant: 技能 %@

source: Skill Creator
ja: スキル作成
zh_hans: 技能创建器
zh_hant: 技能建立器

source: Skill Installer
ja: スキルインストーラー
zh_hans: 技能安装器
zh_hant: 技能安裝器

source: Slash Commands
ja: スラッシュコマンド
zh_hans: 斜杠命令
zh_hant: 斜線命令

source: Slash commands are only available in App Server mode.
ja: スラッシュコマンドは App Server モードでのみ利用できます。
zh_hans: 斜杠命令仅在 App Server 模式下可用。
zh_hant: 斜線命令僅在 App Server 模式下可用。

source: Start a new conversation.
ja: 新しい会話を開始します。
zh_hans: 开始一段新对话。
zh_hant: 開始一段新對話。

source: Start review
ja: レビュー開始
zh_hans: 开始审查
zh_hant: 開始審查

source: Start review in a new thread.
ja: 新しいスレッドでレビューを開始します。
zh_hans: 在新线程中开始评审。
zh_hant: 在新執行緒中開始審查。

source: Started code review in a new thread.
ja: 新しいスレッドでコードレビューを開始しました。
zh_hans: 已在新线程中开始代码审查。
zh_hant: 已在新執行緒中開始程式碼審查。

source: Started review against %@ in a new thread.
ja: 新しいスレッドで %@ に対するレビューを開始しました。
zh_hans: 已在新线程中开始针对 %@ 的审查。
zh_hant: 已在新執行緒中開始針對 %@ 的審查。

source: State
ja: 状態
zh_hans: 状态
zh_hant: 狀態

source: State: %@
ja: 状態: %@
zh_hans: 状态：%@
zh_hant: 狀態：%@

source: Status
ja: 状態
zh_hans: 状态
zh_hant: 狀態

source: Stop inference
ja: 推論停止
zh_hans: 停止推理
zh_hant: 停止推論

source: Submit
ja: 提交
zh_hans: 提交
zh_hant: 提交

source: Switch next turns to planning mode.
ja: 次のターンを計画モードに切り替えます。
zh_hans: 将下一轮切换到计划模式。
zh_hant: 將下一回合切換到計畫模式。

source: Tap + to add your first host.
ja: + をタップして最初のホストを追加してください。
zh_hans: 点击 + 添加你的第一个主机。
zh_hant: 點擊 + 新增你的第一個主機。

source: Terminal
ja: ターミナル
zh_hans: 终端
zh_hant: 終端

source: The selected host no longer exists.
ja: 選択したホストは存在しません。
zh_hans: 所选主机已不存在。
zh_hant: 所選主機已不存在。

source: Thinking
ja: 思考中
zh_hans: 思考中
zh_hant: 思考中

source: This request type is not yet mapped. Reply from desktop fallback if needed.
ja: このリクエスト種別はまだ未対応です。必要ならデスクトップ側で応答してください。
zh_hans: 此请求类型尚未映射。如有需要，请在桌面端回退处理。
zh_hant: 此請求類型尚未對應。如有需要，請在桌面端回退處理。

source: Thread reload requested.
ja: スレッド再読み込みを要求しました。
zh_hans: 已请求重新加载线程。
zh_hant: 已要求重新載入執行緒。

source: Threads
ja: スレッド
zh_hans: 线程
zh_hant: 執行緒

source: Turn completed.
ja: ターンが完了しました。
zh_hans: 本轮已完成。
zh_hant: 本輪已完成。

source: Unavailable
ja: 利用不可
zh_hans: 不可用
zh_hant: 不可用

source: Unknown
ja: 不明
zh_hans: 未知
zh_hant: 未知

source: Unsupported message from app-server.
ja: app-server から未対応のメッセージを受信しました。
zh_hans: 收到 app-server 的不受支持消息。
zh_hant: 收到 app-server 的不支援訊息。

source: Updated: %@
ja: 更新: %@
zh_hans: 更新时间：%@
zh_hant: 更新時間：%@

source: Upgrade available: %@
ja: アップグレード可能: %@
zh_hans: 有可用升级：%@
zh_hant: 有可用升級：%@

source: Use This Path
ja: このパスを使用
zh_hans: 使用此路径
zh_hant: 使用此路徑

source: User Input Required
ja: ユーザー入力が必要
zh_hans: 需要用户输入
zh_hant: 需要使用者輸入

source: Username
ja: ユーザー名
zh_hans: 用户名
zh_hant: 使用者名稱

source: WebSocket handshake failed before app-server initialization. Verify the app-server URL is reachable and update codex-cli on the remote host if needed, or use Terminal tab.
ja: app-server 初期化前に WebSocket ハンドシェイクが失敗しました。app-server URL への到達性を確認し、必要であればリモートホストの codex-cli を更新するか、Terminal タブを使用してください。
zh_hans: 在 app-server 初始化前 WebSocket 握手失败。请确认 app-server URL 可达，并在需要时更新远程主机上的 codex-cli，或改用 Terminal 标签页。
zh_hant: 在 app-server 初始化前 WebSocket 握手失敗。請確認 app-server URL 可達，並在需要時更新遠端主機上的 codex-cli，或改用 Terminal 分頁。

source: XHigh
ja: 極高
zh_hans: 极高
zh_hant: 極高

source: not required
ja: 不要
zh_hans: 不需要
zh_hant: 不需要

source: required
ja: 必須
zh_hans: 必需
zh_hant: 必需

source: running
ja: 稼働中
zh_hans: 运行中
zh_hant: 執行中

source: stopped
ja: 停止中
zh_hans: 已停止
zh_hant: 已停止

source: unknown
ja: 不明
zh_hans: 未知
zh_hant: 未知

source: unknown host
ja: 不明なホスト
zh_hans: 未知主机
zh_hant: 未知主機

source: unnamed
ja: 名前なし
zh_hans: 未命名
zh_hant: 未命名

source: OK
zh_hans: 确定
zh_hant: 確定

source: thread: %@
zh_hans: 线程：%@
zh_hant: 執行緒：%@

source: turn: %@
zh_hans: 轮次：%@
zh_hant: 回合：%@
